1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [44]:
import pandas as pd
import numpy as np

In [45]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [46]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [47]:
#filling missing values
df.FlightNumber= df["FlightNumber"].interpolate()

In [48]:
#changing dtype
df.FlightNumber= df["FlightNumber"].astype("int")

In [49]:
df.FlightNumber.dtype

dtype('int32')

In [50]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

<B>
________________________________________________________________________________________________________________________________


2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [51]:
#making temp df and splitting

df_temp = df.From_To.str.split("_",expand=True)

df_temp.columns = ['From', 'To']

df_temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

<B>
________________________________________________________________________________________________________________________________

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [52]:
#capitalize first letter 

df_temp.From=df_temp.From.str.capitalize()

df_temp.To = df_temp.To.str.capitalize()

df_temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

<B>
_______________________________________________________________________________________________________________________________

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [64]:
#dropping Column 0 from df

df_drop = df.drop("From_To", axis=1)

In [103]:
#Concatenate df_temp to df_drop

df_concat = pd.concat([df_drop,df_temp],axis=1)

df_concat

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

<B>
_______________________________________________________________________________________________________________________________

    
5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
    
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [104]:
#Seperating values from RecentDelay into single columns
#Making new df, renaming the columns

df_delays=pd.DataFrame(df_concat["RecentDelays"].values.tolist())
df_delays.columns=["Delays_{}".format(n) for n in range(1,len(df_delays.columns)+1)]
df_delays

   Delays_1  Delays_2  Delays_3
0      23.0      47.0       NaN
1       NaN       NaN       NaN
2      24.0      43.0      87.0
3      13.0       NaN       NaN
4      67.0      32.0       NaN

In [107]:
#dropping RecentDelay column
df_delays_drop= df_concat.drop("RecentDelays", axis=1)

In [106]:
#Concatenate df_delays_drop with df_delays

df_delays_concat = pd.concat([df_delays_drop,df_delays], axis = 1)
df_delays_concat

,FlightNumber,Airline,From,To,Delays_1,Delays_2,Delays_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN